app/controllers/api/v1/classrooms_controller.rb

  def index
    @classrooms = Classroom.all
---
SELECT "classrooms".* FROM "classrooms"

  def create
    @classroom = Classroom.new(classroom_params)

    if @classroom.save
---
INSERT INTO "classrooms" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Framboise"], ["created_at", "2020-06-09 07:20:55.655616"], ["updated_at", "2020-06-09 07:20:55.655616"]]