app/controllers/api/v1/courses_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN ($1, $2)  [["id", 3], ["id", 2]]
SELECT "courses".* FROM "courses"
---
  def index
    @courses = Course.includes(:categories)