app/models/usersession.rb

SELECT "usersessions".* FROM "usersessions" WHERE "usersessions"."student_id" = $1  [["student_id", 12]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def one_at_once
    @studentUsersessions = Usersession.where(student_id: (User.find(self.student_id)))
    @studentUsersessions.each do |userSession|